//**************************************************************************
//**************************************************************************
//**                                                                      **
//**        (C)Copyright 1985-2019, American Megatrends, Inc.             **
//**                                                                      **
//**                       All Rights Reserved.                           **
//**                                                                      **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093            **
//**                                                                      **
//**                       Phone: (770)-246-8600                          **
//**                                                                      **
//**************************************************************************
//**************************************************************************

//<AMI_FHDR_START>
//---------------------------------------------------------------------------
//
// Name:	CPU.uni
//
// Description:	
//  Setup definition for CPU	
//
//---------------------------------------------------------------------------
//<AMI_FHDR_END>
/=#
#include "VFR.uni"

#langdef   x-AMI "x-AMI"    // AMI Configuration Language

//
// CPU Configuration
//
#string STR_NULL_HELP                   #language eng ""
#string STR_NULL_HELP                   #language fra ""

#string STR_CPU_FORM                    #language eng "CPU Configuration"
#string STR_CPU_FORM                    #language fra "Configuration d'Unité centrale de traitement"

#string STR_CPU_FORM_HELP               #language eng "CPU Configuration Parameters"
#string STR_CPU_FORM_HELP               #language fra "Paramètres De Configuration d'Unité centrale de traitement"

#string STR_PROCESSOR_NODE_COUNT        #language eng "Number of Nodes: "
#string STR_PROCESSOR_NODE_COUNT        #language fra "Nombre de noeuds: "

#string STR_DISABLED                    #language eng "Disabled"
#string STR_ENABLE                      #language eng "Enabled"
#string STR_CPU_AUTO                    #language eng "Auto"

#string STR_PROCESSOR_NODE_COUNT_VALUE   #language eng ""

#string STR_NODE0_FORM                    #language eng "Node 0 Information"
#string STR_NODE0_FORM                    #language fra "L'Information Du Noeud 0"
#string STR_NODE1_FORM                    #language eng "Node 1 Information"
#string STR_NODE1_FORM                    #language fra "L'Information Du Noeud 1"


#string STR_NODE0_HELP                    #language eng "View Information related to Node 0"
#string STR_NODE0_HELP                    #language fra "L'information de vue liée au noeud 0"
#string STR_NODE1_HELP                    #language eng "View Information related to Node 1"
#string STR_NODE1_HELP                    #language fra "L'information de vue liée au noeud 1"


// Do not translate the following!  The name is trademarked.
#string STR_PROCESSOR_HT_MODE           #language eng "Hyper Threading  Technology "
#string STR_PROCESSOR_HT_MODE           #language fra "Hyper Threading  Technology "

#string STR_PROCESSOR_HT_MODE_HELP      #language eng "Select Disabled if your operating system is Windows 2000"
#string STR_PROCESSOR_HT_MODE_HELP      #language fra "Sélectionnez Désactiver sous Windows 2000"
//#string STR_PROCESSOR_HT_MODE_HELP      #language spa "Seleccione Inhabilitado, si el SO es Windows 2000"

#string STR_PROCESSOR_VERSION_VALUE     #language eng ""
#string STR_PROCESSOR_VERSION_VALUE1    #language eng ""
#string STR_PROCESSOR_VERSION_VALUE2    #language eng ""
#string STR_PROCESSOR_VERSION_VALUE3    #language eng ""

#string STR_PROCESSOR_CORE_VALUE        #language eng ""
#string STR_PROCESSOR_CORE_VALUE1        #language eng ""
#string STR_PROCESSOR_CORE_VALUE2        #language eng ""
#string STR_PROCESSOR_CORE_VALUE3        #language eng ""

#string STR_PROCESSOR_SPEED_VALUE       #language eng ""
#string STR_PROCESSOR_SPEED_VALUE_MIN   #language eng ""
#string STR_PROCESSOR_SPEED_VALUE1       #language eng ""
#string STR_PROCESSOR_SPEED_VALUE2       #language eng ""
#string STR_PROCESSOR_SPEED_VALUE3       #language eng ""

#string STR_PROCESSOR_FAMILY_VALUE   #language eng ""
#string STR_PROCESSOR_FAMILY_VALUE1  #language eng ""
#string STR_PROCESSOR_FAMILY_VALUE2  #language eng ""
#string STR_PROCESSOR_FAMILY_VALUE3  #language eng ""
#string STR_PROCESSOR_MODEL_VALUE    #language eng ""
#string STR_PROCESSOR_MODEL_VALUE1   #language eng ""
#string STR_PROCESSOR_MODEL_VALUE2   #language eng ""
#string STR_PROCESSOR_MODEL_VALUE3   #language eng ""
#string STR_PROCESSOR_STEPPING_VALUE    #language eng ""
#string STR_PROCESSOR_STEPPING_VALUE1   #language eng ""
#string STR_PROCESSOR_STEPPING_VALUE2   #language eng ""
#string STR_PROCESSOR_STEPPING_VALUE3   #language eng ""
#string STR_CACHE_INFO_STRING           #language eng "--------- Cache per Core ---------"
#string STR_CACHE_INFO_STRING           #language fra "-- Information de cachette par noyau --"
#string STR_CACHE_INFO_STRING_TOTAL     #language eng "--------- Cache information ---------"

//------------------------------------------------------------------
// L1 Data cache information
#string STR_PROCESSOR_L1_DCACHE_VALUE    #language eng ""
#string STR_PROCESSOR_L1_DCACHE_VALUE1    #language eng ""
#string STR_PROCESSOR_L1_DCACHE_VALUE2    #language eng ""
#string STR_PROCESSOR_L1_DCACHE_VALUE3    #language eng ""

//------------------------------------------------------------------
// L1 Instruction cache information
#string STR_PROCESSOR_L1_ICACHE_VALUE    #language eng ""
#string STR_PROCESSOR_L1_ICACHE_VALUE1    #language eng ""
#string STR_PROCESSOR_L1_ICACHE_VALUE2    #language eng ""
#string STR_PROCESSOR_L1_ICACHE_VALUE3    #language eng ""

//------------------------------------------------------------------
// L2 Data cache information
#string STR_PROCESSOR_L2_CACHE_VALUE    #language eng ""
#string STR_PROCESSOR_L2_CACHE_VALUE1    #language eng ""
#string STR_PROCESSOR_L2_CACHE_VALUE2    #language eng ""
#string STR_PROCESSOR_L2_CACHE_VALUE3    #language eng ""

//------------------------------------------------------------------
// L3 cache information
#string STR_PROCESSOR_L3_CACHE_VALUE    #language eng ""
#string STR_PROCESSOR_L3_CACHE_VALUE1    #language eng ""
#string STR_PROCESSOR_L3_CACHE_VALUE2    #language eng ""
#string STR_PROCESSOR_L3_CACHE_VALUE3    #language eng ""

//------------------------------------------------------------------
// Microcode information
#string STR_PROCESSOR_MICROCODE_VALUE   #language eng "Microcode Not loaded"
#string STR_PROCESSOR_MICROCODE_VALUE1   #language eng "Microcode Not loaded"
#string STR_PROCESSOR_MICROCODE_VALUE2   #language eng "Microcode Not loaded"
#string STR_PROCESSOR_MICROCODE_VALUE3   #language eng "Microcode Not loaded"

#string STR_LIMIT_CPUID_MAX_PROMPT		#language eng "Limit CPUID Maximum"
#string STR_LIMIT_CPUID_MAX_PROMPT		#language fra "Maximum De la Limite CPUID"
#string STR_LIMIT_CPUID_MAX_PROMPT_HELP	#language eng "Disabled for Windows XP"
#string STR_LIMIT_CPUID_MAX_PROMPT_HELP	#language fra "Neutralisé pour Windows XP"

#string STR_ENHANCED_DEBUG_PROMPT		#language eng "Enhanced Debug"
#string STR_ENHANCED_DEBUG_PROMPT_HELP	#language eng "Disabled for normal system operation, Enabled for test environments."

//------------------------------------------------------------------
// PowerNow information


#string	 STR_PNOW_ASL					#language eng "PSS Support"
                                        #language x-AMI "CPU001"
#string	 STR_PNOW_ASL_HELP				#language eng "Enable/disable the generation of ACPI _PPC, _PSS, and _PCT objects."
#string	 STR_PSTATE_CONTROL				#language eng "PSTATE Adjustment"
                                        #language x-AMI "CPU002"
#string	 STR_PSTATE_CONTROL_HELP		#language eng "Provide to adjust startup P-state level"
#string  STR_PPC_CONTROL				#language eng "PPC Adjustment"
                                        #language x-AMI "CPU003"
#string	 STR_PPC_CONTROL_HELP			#language eng "Provide to adjust _PPC object."
#string	 STR_PSTATE0		    		#language eng "PState 0"
#string	 STR_PSTATE1		    		#language eng "PState 1"
#string	 STR_PSTATE2		    		#language eng "PState 2"
#string	 STR_PSTATE3		    		#language eng "PState 3"
#string	 STR_PSTATE4		    		#language eng "PState 4"
#string	 STR_PSTATE5		    		#language eng "PState 5"
#string	 STR_PSTATE6		    		#language eng "PState 6"
#string	 STR_PSTATE7		    		#language eng "PState 7"

//------------------------------------------------------------------
// No-execute page protection information
#string  STR_NX_MODE                    #language eng "NX Mode"
                                        #language x-AMI "CPU004"
#string  STR_NX_MODE_HELP               #language eng "Enable/disable No-execute page protection Function"

//------------------------------------------------------------------
// SVM information
#string	 STR_SVM_MODE					#language eng "SVM Mode"
                                        #language x-AMI "CPU005"
#string	 STR_SVM_MODE_HELP				#language eng "Enable/disable CPU Virtualization"

//------------------------------------------------------------------
// C6 information
#string	 STR_C6_MODE					#language eng "C6 Mode"
                                        #language x-AMI "CPU006"
#string	 STR_C6_MODE_HELP				#language eng "Enable/disable C6"

//------------------------------------------------------------------
// CPB information
#string	 STR_CPB_MODE					#language eng "CPB Mode"
                                        #language x-AMI "CPU007"
#string	 STR_CPB_MODE_HELP				#language eng "Auto/disable CPB"

//------------------------------------------------------------------
// Core Leveling information
#string	 STR_CORE_LEVELING_MODE         #language eng "Core Leveling Mode"
                                        #language x-AMI "CPU008"
#string	 STR_CORE_LEVELING_MODE_HELP    #language eng "Change the number of compute unit in the system"
#string	 STR_CORE_LEVEL_LOWEST          #language eng "Automatic mode"
#string	 STR_CORE_LEVEL_ONE             #language eng "One core per processor"
#string	 STR_CORE_LEVEL_TWO             #language eng "One Compute Unit"
#string	 STR_CORE_LEVEL_THREE           #language eng "Three cores per processor"
#string	 STR_CORE_LEVEL_FOUR            #language eng "Four cores per processor"

//------------------------------------------------------------------
// SMEE information
#string  STR_SMEE                       #language eng "SMEE"
                                        #language x-AMI "CPU009"
#string  STR_SMEE_HELP                  #language eng "Control secure memory encryption enable. Hygon Ax series CPUs do not support SMEE"

#string  INSTALLED_CPU_SOCKET           #language eng "CPU Socket(s)"
#string  INSTALLED_CPU_SOCKET_HELP      #language eng "Valid Number of CPU sockets"

//**************************************************************************
//**************************************************************************
//**                                                                      **
//**        (C)Copyright 1985-2019, American Megatrends, Inc.             **
//**                                                                      **
//**                       All Rights Reserved.                           **
//**                                                                      **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093            **
//**                                                                      **
//**                       Phone: (770)-246-8600                          **
//**                                                                      **
//**************************************************************************
//**************************************************************************